[
  {
    "id": "1",
    "name": "Single Ply Roofing",
    "title": "If you are looking to install a roof on your property that will stand the test of time for years to come, Roofling can help you by delivering top notch workmanship coupled with the most durable roofing materials.",
    "details": "A well-painted roof offers more than curb appeal and a pleasant aesthetic. Flaking paint looks terrible, and your roof’s exterior paint peels both on the inside and outside. When the paint degrades, your roof is left less protected against weather and the elements. The damage incurred from paint degradation adds up over time.",
    "details2": "Once water and moisture damage set in, complications build-up, and expensive problems arise. Look for dark spots on your roof, ceiling, and walls. You can also look for the leaks first and trace them back to the point of damage. Corroded metal is another telltale sign of water damage. When it comes to water damage, diagnosis can become challenging and is best performed by professional roofing contractors.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "Your roof is subject to the wear and tear of the elements. Hence, it's important that you maintain it regularly over the whole year.",
    "professional": "Remember, even the sturdiest roof will wear away over time, so you need to prepare for this.",
    "maintenance": "This is one instance where asking advice from roofing contractors like Roofling will prove beneficial.",
    "support": "They have the experience and knowledge necessary to help you do proper maintenance.",
    "price": "$200",
    "review": "524",
    "rate": "2.3"
  },
  {
    "id": "1",
    "name": "Roofing Cleaning",
    "title": "Our diligent roofers possess the necessary expertise in providing roof repair services, where they not only identify the actual problem with your roof but also utilise the appropriate method to perform roof repairs.",
    "details": "Broken tiles leave your home vulnerable to weather damage. It only takes one faulty tile to allow moisture, water, and organic matter to accumulate. A broken tile can lead to loss in multiple forms, including damage to your insulation, staining, and the swelling of your walls and ceiling. Organic matter like mould and moss can set in, along with termites. Anywhere moisture gathers, problems gather, especially rot. Once wood rots, repairing it is very expensive.",
    "details2": "Keep your roofing elements well-maintained, and you will avoid repairs and replacement costs. The downpipes, gutters, roof valleys, and any loose materials around the piping, vents, and chimney are all elements that can indicate areas of damage.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "Laminated shingles, however, are broader and you may need longer nails to secure them in place.",
    "professional": "Gutters are useful because they direct rainwater away from your roof, so it doesn't collect on the roof's surface, but this can still cause leaks over time.",
    "maintenance": "The problem arises when the gutters get congested. This is usually due to leaves and other debris getting trapped there over time. Storms, in particular,",
    "support": "Luckily, you can easily avoid all this by decluttering your gutter regularly. We also recommend pruning any nearby trees, especially right before the rainy season.",
    "price": "$500",
    "review": "987",
    "rate": "2.5"
  },
  {
    "id": "1",
    "name": "Buildup Roofing",
    "title": "Our roof restoration services make use of state of the art equipment to clean your roof, clear it of any moss, lichen or fungus growth and fix any other problems to restore your roof to its prime condition.",
    "details": "Flashing is another consideration. Roof flashing consists of thin building materials meant to prevent elemental and water damage. These pieces, especially in older homes, break down over time. Metal flashing offers the best option. New flashing typically is made from aluminium, zinc, copper, lead, or other metals.",
    "details2": "Exposure to weather, moisture, trees, debris, and pollution accelerates aging. Most roofs last 20 to 25 years if properly maintained. Once youve learned your roofs age, you can check to see what kind of repairs are needed. If you have a young roof (of 10 years or less) that requires substantial repairs, you should invest in reroofing or roof replacement.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "If there are lots of shingles scattered around your house (after a storm, for example), then this might very well be the cause of your leak.",
    "professional": "Missing shingles from your roof can allow water to seep in near",
    "maintenance": "Luckily, it's easy to repair shingles. You just need to nail them back in place. However, note the type of shingle your roof is using.",
    "support": "Asphalt shingles are more straightforward and just need standard nails.",
    "price": "$258",
    "review": "659",
    "rate": "5.8"
  },
  {
    "id": "1",
    "name": "ROOF INSTALLATION",
    "title": "Our roofing contractors are skilled with the re-roofing process and walk the extra mile to deliver top tier service while being cautious and don't disturb the existing ceiling and plaster of your home during the process.",
    "details": "Proper maintenance and repairs keep your roof looking its best. Overall, consistent maintenance and repairs save you from the costs incurred by complications down the road.",
    "details2": "Your roof is an essential part of your home and an important part of your investment. Neglecting your roof over time leaves it open to elemental damage. Aging, and damage that's left untreated, lead to significant problems and high costs. Hiring experts to help maintain your roof is the best option in the long run.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "Most likely, they were tiny holes that slowly grew in size until they became a full-blown leak.",
    "professional": "Depending on the hole, you can do most of the work on your own without needing to hire a roofing contractor.",
    "maintenance": "You can just use a specific primer or patching system to help seal these holes.",
    "support": "It's also advisable to check for holes regularly throughout the year. Smaller problems are manageable if they're caught early on.",
    "price": "$200",
    "review": "456",
    "rate": "5.5"
  },
  {
    "id": "1",
    "name": "ROOF REPAIR",
    "title": "Roofling has curated experienced roofers who are especially trained in metal roof installation. Metal roofs installed by our roofers are well equipped to reduce solar gains thereby helping to lower your electricity bills significantly.",
    "details": "Roof leaks cause a noticeable amount of dread and anxiety, and with good reasons. Home and business owners alike need proper protection from leaks. Neglecting a leak can be a recipe for disaster. It's always best to take immediate action. In what follows, we will walk you through what to do when you suspect you have a leak.",
    "details2": "Visible bulges and stains in your walls or ceilings almost always indicate the presence of a leak. Before serious repairs can take place, you'll first have to wait for any inclement weather to abate. Until then, here are some things you can do to stem the leak.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "A leaking roof is a common problem for many homes. But the problem is that not everyone can repair a leaking roof by themselves.",
    "professional": "That said, roof repairs involving a leak are relatively straightforward to do. You just need to make sure you know",
    "maintenance": "Most roof leaks are caused by small holes in your roof. Typically, however, these didn't happen overnight.",
    "support": "Most likely, they were tiny holes that slowly grew in size until they became a full-blown leak.",
    "price": "$423",
    "review": "789",
    "rate": "5.00"
  },
  {
    "id": "1",
    "name": "ROOF RESTORATION",
    "title": "If you are looking to install a tiled roof that can last for a lifetime without losing its lustre, our roofers at Roofling who are well equipped with high quality material and enviable skill set, can help you.",
    "details": "Use a container such as a bucket or waste paper bin to capture dripping water. If you want to avoid unwanted dripping sounds, you can place a board inside the container that is catching the leaking water. Water striking against wood does not produce the distressing noise we typically associate with a leak.",
    "details2": "Next, you can use a screwdriver or pick to punch a small hole in the ceiling area that is bulging. This measure helps to control the leak by allowing the water to flow more steadily, keep the damage from spreading or collapsing part of your ceiling.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "applies if your roof didn't comply with building codes, and thus requires you to do some renovations to rectify those mistakes.",
    "professional": "This is why it’s essential to be very picky with who you entrust your roofing work to.",
    "maintenance": "If you want the best contractor to do your construction and repairs, pick a company that has a stellar track record like Roofling.",
    "support": "However, most policies will only cover for the repairs that the calamity affected directly.",
    "price": "$478",
    "review": "548",
    "rate": "2.3"
  },
  {
    "id": "1",
    "name": "RE-ROOFING",
    "title": "We help provide your roof with appropriate care and protection through our thorough roof cleaning and repair services, where we ensure that your roof is restored to its former glory. We pay attention to detail and use only the highest quality materials.",
    "details": "For the exterior, you can use a tarp if you know the source of the leak. Be sure to use caution when mounting your roof, especially during severe weather and high winds. If you're not entirely comfortable, contact a professional, which you will likely have to do later on.",
    "details2": "Most contractors are capable and willing to perform emergency roof work. Diagnosing a leak can be challenging. Professionals can properly inspect both the interior and exterior of your home or business",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "However, most policies will only cover for the repairs that the calamity affected directly.",
    "professional": "So if your roof tiles get blown off because they were broken to begin with, your policy will most likely not cover this.",
    "maintenance": "Again, it's a matter of root cause ⎯ whether the natural disaster caused the damage, or just exposed it.",
    "support": "If your roof was damaged because your roofing contractors didn't do an excellent job with it, this wouldn't be covered by your insurance policy.",
    "price": "$400",
    "review": "654",
    "rate": "5.3"
  },
  {
    "id": "1",
    "name": "METAL ROOFING",
    "title": "Our expert Australian roofers manage your roof installation process from the beginning to the end while ensuring a seamless workflow. The roofs we install come with a guarantee to withstand adverse weather conditions and provide protection for years to come.",
    "details": "You don't want to delay in addressing a leak. They don't go away on their own, and they always spread. If you notice a bulge or stain in your walls or ceilings, check immediately. You should probably expect there to be more damage than you're aware of. It's best to check your roof at least twice a year, especially during a change in season. Inspecting the inside of your home as well as the exterior is the best practice.",
    "details2": "There are many signs of deterioration of your roof and gutter. Things to watch out for include tiles that leak, rusted valleys, cracking or chipping of the mortar around the roof, blockages by leaf and debris, and other issues.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "The problem with normal deterioration like this is that it is usually NOT covered by home insurance policies.",
    "professional": "The conventional wisdom places the responsibility of maintenance to the owners",
    "maintenance": "This distinction applies even if a calamity caused your roof to collapse or further break down.",
    "support": "Typically, insurance would cover it, but if the ultimate cause of your roof deteriorating is lack of maintenance, it’s not counted.",
    "price": "784",
    "review": "589",
    "rate": "4.7"
  },
  {
    "id": "1",
    "name": "ROOF TILING",
    "title": "We can help maintain your roof to its ideal condition by providing regular roof inspections and on-time roof repairs without delays that can possibly aggravate your roof’s deteriorating condition and end up in hefty repair costs.",
    "details": "Leaks typically mean a system problem. The longer you wait, the more expensive they become. Regular inspection, and discussing your situation with roofing contractors, are your best weapons in saving money otherwise spent on expensive roof work. In many cases, a roof restoration will fix any leaks and give your roof a new lease on life.",
    "details2": "Use a container such as a bucket or waste paper bin to capture dripping water. If you want to avoid unwanted dripping sounds, you can place a board inside the container that is catching the leaking water. Water striking against wood does not produce the distressing noise we typically associate with a leak.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "This is probably one of the most common reasons most people will do roofing work",
    "professional": "Like any part of your house, your roof is subject to normal wear and tear.",
    "maintenance": "Especially since it is exposed to the harsh elements, roofs and could require repairs more often.",
    "support": "On average, most roofing needs maintenance every 15-20 years if it's well built using durable materials.",
    "price": "479",
    "review": "256",
    "rate": "4.5"
  },
  {
    "id": "1",
    "name": "ROOF INSTALLATION",
    "title": "Your house is one of your biggest investments in life; one you can't make every other day. Neglecting your roof during or after its installation could pose a threat to your lifetimes' worth investment. At Roofling, we understand the value of your roof and therefore, whether we install or repair it, we do it to last a lifetime.",
    "details": "A ridge cap is a special type of tile that covers the intersection between the edges of your roof tiles. It is usually situated at the highest point of your roof. The ridge cap effectively seals any crevices on your roof tiles and prevents water from seeping inside of them.",
    "details2": "Ridge caps are attached to your roof through bedding and pointing. Bedding is a mixture of mortar, sand, and/or cement that is applied to the ridge cap like glue so that it sits firmly in place. Pointing is a flexible material for sealing the joints between the ridge cap and surrounding tiles.",
    "img1": "",
    "img2": "",
    "img3": "",
    "security": "One of the first things to check if you're doing roof repairs is your home insurance policy.",
    "professional": "You might not know it, but your policy might be able to cover some ⎯ or even all ⎯ of your roofing costs.",
    "maintenance": "Of course, specifics will differ, and it will all come down to your specific policy or the country where you reside",
    "support": "Here are some potential situations, and whether you can reimburse your roof work for them or not",
    "price": "$400",
    "review": "789",
    "rate": "3.3"
  }
]